example/query/Poll_event_sensor_specific/EQ_SENSORELEMENT_fieldname.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:query="urn:epcglobal:epcis-query:xsd:1" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <query:Poll>
            <queryName>SimpleEventQuery</queryName>
            <params>
                <param>
                    <!-- EQ, GE, GT, LT, or LE -->
                    <name>EQ_SENSORELEMENT_http://ext.com/ext1#string</name>
                    <value xsi:type="query:ArrayOfString">
                        <string>string</string>
                    </value>
                    <!--
                    <value xsi:type="xsd:integer">16</value>
                    -->
                </param>
            </params>
        </query:Poll>
    </soapenv:Body>
</soapenv:Envelope>